---
title: DetailCurveArray
classe: Autodesk.Revit.DB.DetailCurveArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# DetailCurveArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `detailCurveArray.IsEmpty` | Boolean |
| `DetailCurve Item { get; set; }` | `detailCurveArray.Item` | DetailCurve |
| `Int32 Size { get; }` | `detailCurveArray.Size` | Int32 |
| `Void Append(DetailCurve)` | `detailCurveArray.Append(item)` | Void |
| `Void Clear()` | `detailCurveArray.Clear()` | Void |
| `DetailCurveArrayIterator ForwardIterator()` | `detailCurveArray.ForwardIterator()` | DetailCurveArrayIterator |
| `IEnumerator GetEnumerator()` | `detailCurveArray.GetEnumerator()` | IEnumerator |
| `Void Insert(DetailCurve, Int32)` | `detailCurveArray.Insert(item, index)` | Void |
| `DetailCurveArrayIterator ReverseIterator()` | `detailCurveArray.ReverseIterator()` | DetailCurveArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```